// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// Console.WriteLine("введите число");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("введите степень");
// int b = Convert.ToInt32(Console.ReadLine());
// int c = 1;
// for (int i = 0; i <b; i ++)
// {
// c= c*a;
// }
// Console.WriteLine(c);





// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// Console.WriteLine("Введите число");
// int a = Convert.ToInt32(Console.ReadLine());
// int b = 0;
// int sum = 0;
// while (a > 0)
// {
//     b = a % 10;
//     sum = sum + b;
//     a = a / 10;
// }
// Console.WriteLine(sum);




// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// int[] mass = new int[8];
// Random newMass = new Random();
// for (int i = 0; i < mass.Length; i++ )
// {
// mass[i]= newMass.Next(0,10);
// Console.Write($" {mass[i]}");
// }
